---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.DirectContext3DFailures
source: html/93e6e79a-697a-c3a6-32d7-39383ca89da9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DirectContext3DFailures

## Syntax (C#)
```csharp
public static class DirectContext3DFailures
```